app/Controllers/AdminCategory.php

SELECT *
FROM `categories`
ORDER BY `id` DESC
---
    public function index()
    {
        $categoryModel = new CategoryModel();

        $data['kategori'] = $categoryModel->orderBy('id', 'DESC')->findAll();