app/Controllers/AdminProfile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function edit()
    {
        $userModel = new UserModel();
        $adminId = session()->get('admin_id');

        $data['user'] = $userModel->find($adminId);