app/Controllers/AdminArticle.php

SELECT COUNT(*) AS `numrows`
FROM `articles`
LEFT JOIN `categories` ON `categories`.`id` = `articles`.`category_id`
SELECT `articles`.*, `categories`.`name` as `category_name`
FROM `articles`
LEFT JOIN `categories` ON `categories`.`id` = `articles`.`category_id`
ORDER BY `articles`.`created_at` DESC
 LIMIT 10
---
    public function index()
    {
        $articleModel = new ArticleModel();

        // Menggabungkan tabel articles dengan categories untuk mendapatkan nama kategori
        $data['artikel'] = $articleModel->select('articles.*, categories.name as category_name')
                                        ->join('categories', 'categories.id = articles.category_id', 'left')
                                        ->orderBy('articles.created_at', 'DESC')
                                        ->paginate(10, 'artikel');