app/Controllers/Home.php

SELECT `articles`.*, `categories`.`name` as `category_name`
FROM `articles`
LEFT JOIN `categories` ON `categories`.`id` = `articles`.`category_id`
ORDER BY `articles`.`created_at` DESC
SELECT `articles`.*, `categories`.`name` as `category_name`
FROM `articles`
LEFT JOIN `categories` ON `categories`.`id` = `articles`.`category_id`
ORDER BY `articles`.`created_at` DESC
 LIMIT 5
---
    public function index()
    {
        $articleModel = new ArticleModel();
        $keyword = $this->request->getGet('keyword');

        // MENGUNCI QUERY JOIN SECARA LANGSUNG KE MODEL
        $articleModel->select('articles.*, categories.name as category_name');
        $articleModel->join('categories', 'categories.id = articles.category_id', 'left');

        // Mempertahankan fitur pencarian dengan urutan yang benar
        if (!empty($keyword)) {
            $articleModel->groupStart();
            $articleModel->like('articles.title', $keyword);
            $articleModel->orLike('articles.content', $keyword);
            $articleModel->groupEnd();
        }

        $data['artikel'] = $articleModel->orderBy('articles.created_at', 'DESC')->findAll();

        // Ambil 5 artikel terbaru khusus untuk slider di halaman utama (hanya jika tidak sedang mencari)
        if (empty($keyword)) {
            $sliderModel = new ArticleModel();
            $sliderModel->select('articles.*, categories.name as category_name');
            $sliderModel->join('categories', 'categories.id = articles.category_id', 'left');
            $data['slider_artikel'] = $sliderModel->orderBy('articles.created_at', 'DESC')->findAll(5);